cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
  					</field>			
  					<field>			
  						<name>WDINT</name>		
  						<description>Watchdog interrupt flag. Set when the timer reaches the value in WARNINT. Cleared by software.</description>		
  						<bitRange>[3:3]</bitRange>		
  								
  					</field>			
  					<field>			
  						<name>WDPROTECT</name>		
  						<description>Watchdog update mode. This bit is Set Only.</description>		
  						<bitRange>[4:4]</bitRange>		
  						<enumeratedValues>		
  							<name>ENUM</name>		
  							<enumeratedValue>	
  								<name>UPDATE</name>
  								<description>The watchdog reload value (TC) can be changed at any time.</description>
  								<value>0</value>
  							</enumeratedValue>	
  							<enumeratedValue>	
  								<name>BLOCKED</name>
  								<description>The watchdog reload value (TC) can be changed only after the counter is below the value of WARNINT and WINDOW. Note: this mode is intended for use only when WDRESET =1.</description>
  								<value>1</value>
  							</enumeratedValue>	
  						</enumeratedValues>		
  					</field>			
  					<field>			
  						<name>RESERVED</name>		
  						<description>Reserved. Read value is undefined, only zero should be written.</description>		
  						<bitRange>[31:5]</bitRange>		
  						
  					</field>			
  				</fields>				
  			</register>					
  			<register>					
  				<name>TC</name>				
  				<description>Watchdog timer constant register. This register determines the time-out value.</description>				
  				<addressOffset>0x004</addressOffset>				
  				<access>read-write</access>				
  				<resetValue>0xFF</resetValue>				
  				<resetMask>0xFFFFFFFF</resetMask>				
  				<fields>				
  					<field>			
  						<name>COUNT</name>		
  						<description>Watchdog time-out interval.</description>		
  						<bitRange>[23:0]</bitRange>		
  					</field>			
  					<field>			
  						<name>RESERVED</name>		
  						<description>Reserved. Read value is undefined, only zero should be written.</description>		
  						<bitRange>[31:24]</bitRange>		
  					</field>			
  				</fields>				
  			</register>					
  			<register>					
  				<name>FEED</name>				
  				<description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in TC.</description>				
  				<addressOffset>0x008</addressOffset>				
  				<access>write-only</access>				
  				<resetValue>0</resetValue>				
  				<resetMask>0x00000000</resetMask>				
  				<fields>				
  					<field>			
  						<name>FEEDVAL</name>		
  						<description>Feed value should be 0xAA followed by 0x55.</description>		
  						<bitRange>[7:0]</bitRange>		
  					</field>			
  					<field>			
  						<name>RESERVED</name>		
  						<description>Reserved</description>		
  						<bitRange>[31:8]</bitRange>		
  					</field>			
  				</fields>				
  			</register>					
  			<register>					
  				<name>TV</name>				
  				<description>Watchdog timer value register. This register reads out the current value of the Watchdog timer.</description>				
  				<addressOffset>0x00C</addressOffset>				
  				<access>read-only</access>				
  				<resetValue>0xFF</resetValue>				
  				<resetMask>0xFFFFFFFF</resetMask>				
  				<fields>				
  					<field>			
  						<name>COUNT</name>		
  						<description>Counter timer value.</description>		
  						<bitRange>[23:0]</bitRange>		
  					</field>			
  					<field>			
  						<name>RESERVED</name>		
  						<description>Reserved. Read value is undefined, only zero should be written.</description>		
  						<bitRange>[31:24]</bitRange>		
  					</field>			
  				</fields>				
  			</register>					
  			<register>					
  				<name>WARNINT</name>				
  				<description>Watchdog Warning Interrupt compare value.</description>				
  				<addressOffset>0x014</addressOffset>				
  				<access>read-write</access>				
  				<resetValue>0</resetValue>				
  				<resetMask>0xFFFFFFFF</resetMask>				
  				<fields>				
  					<field>			
  						<name>COMPVAL</name>		
  						<description>Watchdog warning interrupt compare value.</description>		
  						<bitRange>[9:0]</bitRange>		
  					</field>			
  					<field>			
  						<name>RESERVED</name>		
  						<description>Reserved. Read value is undefined, only zero should be written.</description>		
  						<bitRange>[31:10]</bitRange>		
  					</field>			
  				</fields>				
  			</register>					
  			<register>					
  				<name>WINDOW</name>				
  				<description>Watchdog Window compare value.</description>				
  				<addressOffset>0x018</addressOffset>				
  				<access>read-write</access>				
  				<resetValue>0xFFFFFF</resetValue>				
  				<resetMask>0xFFFFFFFF</resetMask>				
  				<fields>				
  					<field>			
  						<name>WINVAL</name>		
  						<description>Watchdog window value.</description>		
  						<bitRange>[23:0]</bitRange>		
  					</field>			
  					<field>			
  						<name>RESERVED</name>		
  						<description>Reserved. Read value is undefined, only zero should be written.</description>		
  						<bitRange>[31:24]</bitRange>		
  					</field>			
  				</fields>				
  			</register>					
  		</registers>						
  		
  	</peripheral>
<peripheral>
	<name>UART0</name>
	<description>UART0</description>
	<groupName>UART0</groupName>
	<baseAddress>0x40008000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>UART0</name>
	<value>21</value>
	</interrupt>
	<registers>										
	<register>									
		<name>RBR</name>								
		<description>Receiver Buffer Register. Contains the next received character to be read. (DLAB=0)</description>								
		<addressOffset>0x000</addressOffset>								
		<access>read-only</access>								
		<resetValue>0</resetValue>								
		<resetMask>0x00000000</resetMask>	
		<readAction>modify</readAction>
		<fields>								
			<field>							
				<name>RBR</name>						
				<description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO.</description>						
				<bitRange>[7:0]</bitRange>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved</description>						
				<bitRange>[31:8]</bitRange>						
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>THR</name>								
		<description>Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0)</description>	
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>								
		<access>write-only</access>								
		<resetValue>0</resetValue>								
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		<fields>								
			<field>							
				<name>THR</name>						
				<description>Writing to the UART Transmit Holding Register causes the data to be stored in the UART transmit FIFO. The byte will be sent when it is the oldest byte in the FIFO and the transmitter is available.</description>						
				<bitRange>[7:0]</bitRange>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved</description>						
				<bitRange>[31:8]</bitRange>						
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>DLL</name>								
		<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>								
		<access>read-write</access>								
		<resetValue>0x01</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>DLLSB</name>						
				<description>The UART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the UART.</description>						
				<bitRange>[7:0]</bitRange>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved</description>						
				<bitRange>[31:8]</bitRange>						
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>DLM</name>								
		<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>								
		<addressOffset>0x004</addressOffset>								
		<access>read-write</access>								
		<resetValue>0</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>DLMSB</name>						
				<description>The UART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the UART.</description>						
				<bitRange>[7:0]</bitRange>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved</description>						
				<bitRange>[31:8]</bitRange>						
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>IER</name>								
		<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. (DLAB=0)</description>
		<alternateRegister>DLM</alternateRegister>
		<addressOffset>0x004</addressOffset>								
		<access>read-write</access>								
		<resetValue>0</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>RBRINTEN</name>						
				<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt. It also controls the Character Receive Time-out interrupt.</description>						
				<bitRange>[0:0]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable the RDA interrupt.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable the RDA interrupt.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>THREINTEN</name>						
				<description>THRE Interrupt Enable. Enables the THRE interrupt. The status of this interrupt can be read from LSR[5].</description>						
				<bitRange>[1:1]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable the THRE interrupt.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable the THRE interrupt.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RLSINTEN</name>						
				<description>Enables the Receive Line Status interrupt. The status of this interrupt can be read from LSR[4:1].</description>						
				<bitRange>[2:2]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable the RLS interrupt.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable the RLS interrupt.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>MSINTEN</name>						
				<description>Enables the Modem Status interrupt. The components of this interrupt can be read from the MSR.</description>						
				<bitRange>[3:3]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable the MS interrupt.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable the MS interrupt.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>						
				<bitRange>[7:4]</bitRange>						
					
