cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>							
			<field>							
				<name>ABEOINTEN</name>						
				<description>Enables the end of auto-baud interrupt.</description>						
				<bitRange>[8:8]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable end of auto-baud Interrupt.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable end of auto-baud Interrupt.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>ABTOINTEN</name>						
				<description>Enables the auto-baud time-out interrupt.</description>						
				<bitRange>[9:9]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable auto-baud time-out Interrupt.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable auto-baud time-out Interrupt.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>						
				<bitRange>[31:10]</bitRange>						
					
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>IIR</name>								
		<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>								
		<addressOffset>0x008</addressOffset>								
		<access>read-only</access>								
		<resetValue>0x01</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>INTSTATUS</name>						
				<description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>						
				<bitRange>[0:0]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>INTERRUPT_PENDING</name>				
						<description>Interrupt pending. At least one interrupt is pending.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>NOT_PENDING</name>				
						<description>Not pending. No interrupt is pending.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>INTID</name>						
				<description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART Rx FIFO. All other values of IER[3:1] not listed below are reserved.</description>						
				<bitRange>[3:1]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>RLS</name>				
						<description>RLS. 1   - Receive Line Status .</description>				
						<value>0x3</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>RDA</name>				
						<description>RDA. 2a - Receive Data Available.</description>				
						<value>0x2</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>CTI</name>				
						<description>CTI. 2b - Character Time-out Indicator.</description>				
						<value>0x6</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>THRE</name>				
						<description>THRE. 3   - THRE Interrupt.</description>				
						<value>0x1</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>MODEM_STATUS</name>				
						<description>Modem status. 4   - Modem status</description>				
						<value>0x0</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>						
				<bitRange>[5:4]</bitRange>						
					
			</field>							
			<field>							
				<name>FIFOEN</name>						
				<description>These bits are equivalent to FCR[0].</description>						
				<bitRange>[7:6]</bitRange>						
					
			</field>							
			<field>							
				<name>ABEOINT</name>						
				<description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>						
				<bitRange>[8:8]</bitRange>						
					
			</field>							
			<field>							
				<name>ABTOINT</name>						
				<description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>						
				<bitRange>[9:9]</bitRange>						
					
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>						
				<bitRange>[31:10]</bitRange>						
					
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>FCR</name>								
		<description>FIFO Control Register. Controls UART FIFO usage and modes.</description>	
		<alternateRegister>IIR</alternateRegister>
		<addressOffset>0x008</addressOffset>								
		<access>write-only</access>								
		<resetValue>0</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>FIFOEN</name>						
				<description>FIFO enable</description>						
				<bitRange>[0:0]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLED</name>				
						<description>Disabled. UART FIFOs are disabled. Must not be used in the application.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLED</name>				
						<description>Enabled. Active high enable for both UART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RXFIFORES</name>						
				<description>RX FIFO Reset</description>						
				<bitRange>[1:1]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>NO_EFFECT</name>				
						<description>No effect. No impact on either of UART FIFOs.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>CLEAR</name>				
						<description>Clear. Writing a logic 1 to FCR[1] will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>TXFIFORES</name>						
				<description>TX FIFO Reset</description>						
				<bitRange>[2:2]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>NO_EFFECT</name>				
						<description>No effect. No impact on either of UART FIFOs.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>CLEAR</name>				
						<description>Clear. Writing a logic 1 to FCR[2] will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>						
				<bitRange>[5:3]</bitRange>						
					
