cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>							
			<field>							
				<name>RXTL</name>						
				<description>RX Trigger Level. These two bits determine how many UART FIFO characters must be received by the FIFO before an interrupt is activated.</description>						
				<bitRange>[7:6]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>TRIGGER_LEVEL_0</name>				
						<description>Trigger level 0. (1 character or 0x01).</description>				
						<value>0x0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>TRIGGER_LEVEL_1</name>				
						<description>Trigger level 1. (4 characters or 0x04).</description>				
						<value>0x1</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>TRIGGER_LEVEL_2</name>				
						<description>Trigger level 2. (8 characters or 0x08).</description>				
						<value>0x2</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>TRIGGER_LEVEL_3</name>				
						<description>Trigger level 3. (14 characters or 0x0E).</description>				
						<value>0x3</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved</description>						
				<bitRange>[31:8]</bitRange>						
					
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>LCR</name>								
		<description>Line Control Register. Contains controls for frame formatting and break generation.</description>								
		<addressOffset>0x00C</addressOffset>								
		<access>read-write</access>								
		<resetValue>0</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>WLS</name>						
				<description>Word Length Select</description>						
				<bitRange>[1:0]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>5_BIT</name>				
						<description>5 bit. 5-bit character length.</description>				
						<value>0x0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>6_BIT</name>				
						<description>6 bit. 6-bit character length.</description>				
						<value>0x1</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>7_BIT</name>				
						<description>7 bit. 7-bit character length.</description>				
						<value>0x2</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>8_BIT</name>				
						<description>8 bit. 8-bit character length.</description>				
						<value>0x3</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>SBS</name>						
				<description>Stop Bit Select</description>						
				<bitRange>[2:2]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>1_STOP_BIT</name>				
						<description>1 stop bit.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>2_STOP_BITS</name>				
						<description>2 stop bits. (1.5 if LCR[1:0]=00).</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>PE</name>						
				<description>Parity Enable</description>						
				<bitRange>[3:3]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable parity generation and checking.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable parity generation and checking.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>PS</name>						
				<description>Parity Select</description>						
				<bitRange>[5:4]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>ODD_PARITY</name>				
						<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>				
						<value>0x0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>EVEN_PARITY</name>				
						<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>				
						<value>0x1</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>FORCED_1_STICK_PARIT</name>				
						<description>Forced 1 stick parity.</description>				
						<value>0x2</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>FORCED_0_STICK_PARIT</name>				
						<description>Forced 0 stick parity.</description>				
						<value>0x3</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>BC</name>						
				<description>Break Control</description>						
				<bitRange>[6:6]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable break transmission.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable break transmission. Output pin UART TXD is forced to logic 0 when LCR[6] is active high.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>DLAB</name>						
				<description>Divisor Latch Access Bit</description>						
				<bitRange>[7:7]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE</name>				
						<description>Disable. Disable access to Divisor Latches.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE</name>				
						<description>Enable. Enable access to Divisor Latches.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved</description>						
				<bitRange>[31:8]</bitRange>						
					
