cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>CTCR</name>													
		<description>Count Control register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>													
		<addressOffset>0x070</addressOffset>													
		<access>read-write</access>													
		<resetValue>0</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>CTM</name>											
				<description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: every rising PCLK edge</description>											
				<bitRange>[1:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>TIMER_MODE</name>									
						<description>Timer mode. Timer Mode: every rising PCLK edge</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>COUNTER_MODE_RISING</name>									
						<description>Counter mode rising edge. Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>COUNTER_MODE_FALLING</name>									
						<description>Counter mode falling edge. Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>COUNTER_MODE_EDGES</name>									
						<description>Counter mode edges. Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>CIS</name>											
				<description>Count Input Select. When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking:</description>											
				<bitRange>[3:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>CT32BN_CAP0</name>									
						<description>CT32Bn_CAP0</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CT32BN_CAP1</name>									
						<description>CT32Bn_CAP1</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESERVED</name>									
						<description>Reserved</description>									
						<value>0x2</value>									
					</enumeratedValue>										
														
				</enumeratedValues>											
			</field>												
			<field>												
				<name>ENCC</name>											
				<description>Setting this bit to one enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>											
				<bitRange>[4:4]</bitRange>											
										
			</field>												
			<field>												
				<name>SELCC</name>											
				<description>When bit 4 is one, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is zero.</description>											
				<bitRange>[7:5]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>RIDING_EDGE_CAP0</name>									
						<description>Riding edge CAP0. Rising Edge of CAP0 clears the timer (if bit 4 is set).</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FALLING_EDGE_CAP1</name>									
						<description>Falling edge CAP1. Falling Edge of CAP0 clears the timer (if bit 4 is set).</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RISING_EDGE_CAP1</name>									
						<description>Rising edge CAP1. Rising Edge of CAP1 clears the timer (if bit 4 is set).</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FALLING_EDGE_CAP1</name>									
						<description>Falling edge CAP1. Falling Edge of CAP1 clears the timer (if bit 4 is set).</description>									
						<value>0x3</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESERVED</name>									
						<description>Reserved.</description>									
						<value>0x4</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESERVED</name>									
						<description>Reserved.</description>									
						<value>0x5</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESERVED</name>									
						<description>Reserved.</description>									
						<value>0x6</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESERVED</name>									
						<description>Reserved.</description>									
						<value>0x7</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
										
