cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[31:31]</bitRange>												
												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>SEQA_CTRL</name>														
		<description>A/D Conversion Sequence-A control Register: Controls triggering and channel selection for conversion sequence-A. Also specifies interrupt mode for sequence-A.</description>														
		<addressOffset>0x008</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x0</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>CHANNELS</name>												
				<description>Selects which one or more of the twelve channels will be sampled and converted when this sequence is launched. A 1 in any bit of this field will cause the corresponding channel to be included in the conversion sequence, where bit 0 corresponds to channel 0, bit 1 to channel 1 and so forth.  When this conversion sequence is triggered, either by a hardware trigger or via software command, A/D conversions will be performed on each enabled channel, in sequence, beginning with the lowest-ordered channel.  This field can ONLY be changed while the SEQA_ENA bit (bit 31) is LOW. It is allowed to change this field and set bit 31 in the same write.</description>												
				<bitRange>[11:0]</bitRange>												
												
			</field>													
			<field>													
				<name>TRIGGER</name>												
				<description>Selects which of the available hardware trigger sources will cause this conversion sequence to be initiated. Program the trigger input number in this field. In order to avoid generating a spurious trigger, it is recommended writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to change this field and set bit 31 in the same write.</description>												
				<bitRange>[17:12]</bitRange>												
												
			</field>													
			<field>													
				<name>TRIGPOL</name>												
				<description>Select the polarity of the selected input trigger for this conversion sequence.  In order to avoid generating a spurious trigger, it is recommended writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to change this field and set bit 31 in the same write.</description>												
				<bitRange>[18:18]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NEGATIVE_EDGE</name>										
						<description>Negative edge. A negative edge launches the conversion sequence on the selected trigger input.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>POSITIVE_EDGE</name>										
						<description>Positive edge. A positive edge launches the conversion sequence on the selected trigger input.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SYNCBYPASS</name>												
				<description>Setting this bit allows the hardware trigger input to bypass  synchronization flip-flops stages and therefore shorten the time between the trigger input signal and the start of a conversion. There are slightly different criteria for whether or not this bit can be set depending on the clock operating mode: Synchronous mode: Synchronization may be bypassed (this bit may be set) if the selected trigger source is already synchronous with the main system clock (eg. coming from an on-chip, system-clock-based timer). Whether this bit is set or not, a trigger pulse must be maintained for at least one system clock period. Asynchronous mode: Synchronization may be bypassed (this bit may be set) if it is certain that the duration of a trigger input pulse will be at least one cycle of the ADC clock (regardless of whether the trigger comes from and on-chip or off-chip source). If this bit is NOT set, the trigger pulse must at least be maintained for one system clock period.</description>												
				<bitRange>[19:19]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>ENABLE_SYNCHRONIZATI</name>										
						<description>Enable synchronization. The hardware trigger bypass is not enabled.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>BYPASS_SYNCHRONIZATI</name>										
						<description>Bypass synchronization. The hardware trigger bypass is enabled.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[25:20]</bitRange>												
												
			</field>													
			<field>													
				<name>START</name>												
				<description>Writing a 1 to this field will launch one pass through this conversion sequence. The behavior will be identical to a sequence triggered by a hardware trigger. Do not write 1 to this bit if the BURST bit is set. This bit is only set to a 1 momentarily when written-to in order to launch a conversion sequence. It will consequently always read-back as a zero.</description>												
				<bitRange>[26:26]</bitRange>												
												
			</field>													
			<field>													
				<name>BURST</name>												
				<description>Writing a 1 to this bit will cause this conversion sequence to be continuously cycled through. Other sequence A triggers will be ignored while this bit is set. Repeated conversions can be halted by clearing this bit. The sequence currently in progress will be completed before conversions are terminated.</description>												
				<bitRange>[27:27]</bitRange>												
												
