cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>													
			<field>													
				<name>SINGLESTEP</name>												
				<description>When this bit is set, a hardware trigger or a write to the START bit will launch a single conversion on the next channel in the sequence instead of the default response of launching an entire sequence of conversions. Once all of the channels comprising a sequence have been converted, a subsequent trigger will repeat the sequence beginning with the first enabled channel. Interrupt generation will still occur either after each individual conversion or at the end of the entire sequence, depending on the state of the MODE bit.</description>												
				<bitRange>[28:28]</bitRange>												
												
			</field>													
			<field>													
				<name>LOWPRIO</name>												
				<description>Set priority for sequence A.</description>												
				<bitRange>[29:29]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>LOW_PRIORITY</name>										
						<description>Low priority. Any B trigger which occurs while an A conversion sequence is active will be ignored and lost.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>HIGH_PRIORITY</name>										
						<description>High priority.  Setting this bit to a 1 will permit any enabled B sequence trigger (including a B sequence software start) to immediately interrupt this sequence and launch a B sequence in it's place. The conversion currently in progress will be terminated.  The A sequence that was interrupted will automatically resume after the B sequence completes. The channel whose conversion was terminated will be re-sampled and the conversion sequence will resume from that point.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>MODE</name>												
				<description>Indicates whether the primary method for retrieving conversion results for this sequence will be accomplished via reading the global data register (SEQA_GDAT) at the end of each conversion, or the individual channel result registers at the end of the entire sequence.  Impacts when conversion-complete interrupt for sequence-A will be generated and which overrun conditions contribute to an overrun interrupt as described below:</description>												
				<bitRange>[30:30]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>END_OF_CONVERSION</name>										
						<description>End of conversion. The sequence A interrupt will be set at the end of each individual A/D conversion performed under sequence A. This flag will mirror the DATAVALID bit in the SEQA_GDAT register. The OVERRUN bit in the SEQA_GDAT register will contribute to generation of an overrun interrupt if enabled.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>END_OF_SEQUENCE</name>										
						<description>End of sequence. The sequence A interrupt will be set when the entire set of sequence-A conversions completes. This flag will need to be explicitly cleared by software in this mode.  The OVERRUN bit in the SEQA_GDAT register will NOT contribute to generation of an overrun interrupt since it is assumed this register may not be utilized in this mode.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SEQA_ENA</name>												
				<description>Sequence Enable. In order to avoid spuriously triggering the sequence, care should be taken to only set the SEQA_ENA bit  when the selected trigger input is in its INACTIVE state (as defined by the TRIGPOL bit). If this condition is  not met, the sequence will be triggered immediately upon being enabled.</description>												
				<bitRange>[31:31]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled. Sequence A is disabled. Sequence A triggers are ignored. If this bit is cleared while sequence A is in progress, the sequence will be halted at the end of the current conversion. After the sequence is re-enabled, a new trigger will be required to restart the sequence beginning with the next enabled channel.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>ENABLED</name>										
						<description>Enabled. Sequence A is enabled.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>SEQB_CTRL</name>														
		<description>A/D Conversion Sequence-B Control Register: Controls triggering and channel selection for conversion sequence-B. Also specifies interrupt mode for sequence-B.</description>														
		<addressOffset>0x00C</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x0</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>CHANNELS</name>												
				<description>Selects which one or more of the twelve channels will be sampled and converted when this sequence is launched. A 1 in any bit of this field will cause the corresponding channel to be included in the conversion sequence, where bit 0 corresponds to channel 0, bit 1 to channel 1 and so forth.  When this conversion sequence is triggered, either by a hardware trigger or via software command, A/D conversions will be performed on each enabled channel, in sequence, beginning with the lowest-ordered channel. This field can ONLY be changed while the SEQB_ENA bit (bit 31) is LOW. It is permissible to change this field and set bit 31 in the same write.</description>												
				<bitRange>[11:0]</bitRange>												
												
