cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>													
			<field>													
				<name>TRIGGER</name>												
				<description>Selects which of the available hardware trigger sources will cause this conversion sequence to be initiated. Program the trigger input number in this field.  In order to avoid generating a spurious trigger, it is recommended  writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to  change this field and set bit 31 in the same write.</description>												
				<bitRange>[17:12]</bitRange>												
												
			</field>													
			<field>													
				<name>TRIGPOL</name>												
				<description>Select the polarity of the selected input trigger for this conversion sequence.  In order to avoid generating a spurious trigger, it is recommended  writing to this field only when the SEQA_ENA bit (bit 31) is low. It is safe to  change this field and set bit 31 in the same write.</description>												
				<bitRange>[18:18]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NEGATIVE_EDGE</name>										
						<description>Negative edge. A negative edge launches the conversion sequence on the selected trigger input.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>POSITIVE_EDGE</name>										
						<description>Positive edge. A positive edge launches the conversion sequence on the selected trigger input.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SYNCBYPASS</name>												
				<description>Setting this bit allows the hardware trigger input to bypass  synchronization flip-flops stages and therefore shorten the time between the trigger input signal and the start of a conversion. There are slightly different criteria for whether or not this bit can be set depending on the clock operating mode: Synchronous mode: Synchronization may be bypassed (this bit may be set) if the selected trigger source is already synchronous with the main system clock (eg. coming from an on-chip, system-clock-based timer). Whether this bit is set or not, a trigger pulse must be maintained for at least one system clock period. Asynchronous mode: Synchronization may be bypassed (this bit may be set) if it is certain that the duration of a trigger input pulse will be at least one cycle of the ADC clock (regardless of whether the trigger comes from and on-chip or off-chip source). If this bit is NOT set, the trigger pulse must at least be maintained for one system clock period.</description>												
				<bitRange>[19:19]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>ENABLE_SYNCHRONIZATI</name>										
						<description>Enable synchronization. The hardware trigger bypass is not enabled.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>BYPASS_SYNCHRONIZATI</name>										
						<description>Bypass synchronization. The hardware trigger bypass is enabled.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[25:20]</bitRange>												
												
			</field>													
			<field>													
				<name>START</name>												
				<description>Writing a 1 to this field will launch one pass through this conversion sequence. The behavior will be identical to a sequence triggered by a hardware trigger. Do not write a 1 to this bit if the BURST bit is set.   This bit is only set to a 1 momentarily when written to in order to launch a conversion sequence. It will consequently always read-back as a zero.</description>												
				<bitRange>[26:26]</bitRange>												
												
			</field>													
			<field>													
				<name>BURST</name>												
				<description>Writing a 1 to this bit will cause this conversion sequence to be continuously cycled through. Other B triggers will be ignored while this bit is set.  Repeated conversions can be halted by clearing this bit. The sequence currently in progress will be completed before conversions are terminated.</description>												
				<bitRange>[27:27]</bitRange>												
												
			</field>													
			<field>													
				<name>SINGLESTEP</name>												
				<description>When this bit is set, a hardware trigger or a write to the START bit will launch a single conversion on the next channel in the sequence instead of the default response of launching an entire sequence of conversions. Once all of the channels comprising a sequence have been converted, a subsequent trigger will repeat the sequence beginning with the first enabled channel.  Interrupt generation will still occur either after each individual conversion or at the end of the entire sequence, depending on the state of the MODE bit.</description>												
				<bitRange>[28:28]</bitRange>												
												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[29:29]</bitRange>												
												
			</field>													
			<field>													
				<name>MODE</name>												
				<description>Indicates whether the primary method for retrieving conversion results for this sequence will be accomplished via reading the global data register (SEQB_GDAT) at the end of each conversion, or the individual channel result registers at the end of the entire sequence.   Impacts when conversion-complete interrupt for sequence-B will be generated and which overrun conditions contribute to an overrun interrupt as described below:</description>												
				<bitRange>[30:30]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>END_OF_CONVERSION</name>										
						<description>End of conversion. The sequence B interrupt will be set at the end of each individual A/D conversion performed under sequence B. This flag will mirror the DATAVALID bit in the SEQB_GDAT register.  The OVERRUN bit in the SEQB_GDAT register will contribute to generation of an overrun interrupt if enabled.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>END_OF_SEQUENCE</name>										
						<description>End of sequence. The sequence B interrupt will be set when the entire set of sequence B conversions completes. This flag will need to be explicitly cleared by software in this mode.   The OVERRUN bit in the SEQB_GDAT register will NOT contribute to generation of an overrun interrupt since it is assumed this register will not be utilized in this mode.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SEQB_ENA</name>												
				<description>Sequence Enable. In order to avoid spuriously triggering the sequence, care should be taken to only set the SEQA_ENA bit  when the selected trigger input is in its INACTIVE state (as defined by the TRIGPOL bit). If this condition is  not met, the sequence will be triggered immediately upon being enabled.</description>												
				<bitRange>[31:31]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled. Sequence B is disabled. Sequence B triggers are ignored. If this bit is cleared while sequence B is in progress, the sequence will be halted at the end of the current conversion. After the sequence is re-enabled, a new trigger will be required to restart the sequence beginning with the next enabled channel.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>ENABLED</name>										
						<description>Enabled. Sequence B is enabled.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>SEQA_GDAT</name>														
		<description>A/D Sequence-A Global Data Register. This register contains the result of the most recent A/D conversion performed under sequence-A</description>														
		<addressOffset>0x010</addressOffset>														
		<access>read-write</access>														
		<resetValue>0</resetValue>														
		<resetMask>0x00000000</resetMask>
		<readAction>modify</readAction>
		
		<fields>														
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[3:0]</bitRange>												
			</field>													
			<field>													
				<name>RESULT</name>												
				<description>This field contains the 12-bit A/D conversion result from the most recent conversion performed under conversion sequence associated with this register.   The result is the  a binary fraction representing the voltage on the currently-selected input channel as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VREFN, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on VREFP.  DATAVALID = 1 indicates that this result has not yet been read.</description>												
				<bitRange>[15:4]</bitRange>												
			</field>													
			<field>													
				<name>THCMPRANGE</name>												
				<description>Indicates whether the result of the last conversion performed was above, below or within the range established by the designated threshold comparison registers (THRn_LOW and THRn_HIGH).</description>												
				<bitRange>[17:16]</bitRange>												
			</field>													
			<field>													
				<name>THCMPCROSS</name>												
				<description>Indicates whether the result of the last conversion performed represented a crossing of the threshold level established by the designated LOW threshold comparison register (THRn_LOW) and, if so, in what direction the crossing occurred.</description>												
				<bitRange>[19:18]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[25:20]</bitRange>												
			</field>													
			<field>													
				<name>CHN</name>												
				<description>These bits contain the channel from which the RESULT bits were converted (e.g. 0000 identifies channel 0, 0001 channel 1...).</description>												
				<bitRange>[29:26]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN</name>												
				<description>This bit is set if a new conversion result is loaded into the RESULT field before a previous result has been read - i.e. while the DATAVALID bit is set. This bit is cleared, along with the DATAVALID bit, whenever this register is read.  This bit will contribute to an overrun interrupt request if the MODE bit (in SEQA_CTRL) for the corresponding sequence is set to '0' (and if the overrun interrupt is enabled).</description>												
				<bitRange>[30:30]</bitRange>												
			</field>													
			<field>													
				<name>DATAVALID</name>	
				<description>This bit is set to '1' at the end of each conversion when a new result is loaded into the RESULT field. It is cleared whenever this register is read.  This bit will cause a conversion-complete interrupt for the corresponding sequence if the MODE bit (in SEQA_CTRL) for that sequence is set to 0 (and if the interrupt is enabled).</description>												
				<bitRange>[31:31]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>SEQB_GDAT</name>														
		<description>A/D Sequence-B Global Data Register. This register contains the result of the most recent A/D conversion performed under sequence-B</description>														
		<addressOffset>0x014</addressOffset>														
		<access>read-write</access>														
		<resetValue>0</resetValue>														
		<resetMask>0x00000000</resetMask>	
		<readAction>modify</readAction>
		<fields>														
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[3:0]</bitRange>												
			</field>													
			<field>													
				<name>RESULT</name>												
				<description>This field contains the 12-bit A/D conversion result from the most recent conversion performed under conversion sequence associated with this register.   This will be a binary fraction representing the voltage on the currently-selected input channel as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VREFN, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on V REFP.  DATAVALID = 1 indicates that this result has not yet been read.</description>												
				<bitRange>[15:4]</bitRange>												
			</field>													
			<field>													
				<name>THCMPRANGE</name>												
				<description>Indicates whether the result of the last conversion performed was above, below or within the range established by the designated threshold comparison registers (THRn_LOW and THRn_HIGH).  Threshold Range Comparison result. 0x0 = In Range: The last completed conversion was greater than or equal to the value programmed into the designated LOW threshold register (THRn_LOW) but less than or equal to the value programmed into the designated HIGH threshold register (THRn_HIGH). 0x1 = Below Range: The last completed conversion on was less than the value programmed into the designated LOW threshold register (THRn_LOW). 0x2 = Above Range: The last completed conversion was greater than the value programmed into the designated HIGH threshold register (THRn_HIGH). 0x3 = Reserved.</description>												
				<bitRange>[17:16]</bitRange>												
			</field>													
			<field>													
				<name>THCMPCROSS</name>												
				<description>Indicates whether the result of the last conversion performed represented a crossing of the threshold level established by the designated LOW threshold comparison register (THRn_LOW) and, if so, in what direction the crossing occurred. 0x0 = No threshold Crossing detected: The most recent completed conversion on this channel had the same relationship (above or below) to the threshold value established by the designated LOW threshold register (THRn_LOW) as did the previous conversion on this channel. 0x1 = Reserved. 0x2 = Downward Threshold Crossing Detected. Indicates that a threshold crossing in the downward direction has occurred - i.e. the previous sample on this channel was above the threshold value established by the designated LOW threshold register (THRn_LOW) and the current sample is below that threshold. 0x3 = Upward Threshold Crossing Detected. Indicates that a threshold crossing in the upward direction has occurred - i.e. the previous sample on this channel was below the threshold value established by the designated LOW threshold register (THRn_LOW) and the current sample is above that threshold.</description>												
				<bitRange>[19:18]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[25:20]</bitRange>												
			</field>													
			<field>													
				<name>CHN</name>												
				<description>These bits contain the channel from which the RESULT bits were converted (e.g. 0b0000 identifies channel 0, 0b0001 channel 1...).</description>												
				<bitRange>[29:26]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN</name>												
				<description>This bit is set if a new conversion result is loaded into the RESULT field before a previous result has been read - i.e. while the DATAVALID bit is set. This bit is cleared, along with the DATAVALID bit, whenever this register is read.  This bit will contribute to an overrun interrupt request if the MODE bit (in SEQB_CTRL) for the corresponding sequence is set to 0 (and if the overrun interrupt is enabled).</description>												
				<bitRange>[30:30]</bitRange>												
			</field>													
			<field>													
				<name>DATAVALID</name>												
				<description>This bit is set to 1 at the end of each conversion when a new result is loaded into the RESULT field. It is cleared whenever this register is read.  This bit will cause a conversion-complete interrupt for the corresponding sequence if the MODE bit (in SEQB_CTRL) for that sequence is set to 0 (and if the interrupt is enabled).</description>												
				<bitRange>[31:31]</bitRange>												
			</field>													
		</fields>														
	</register>															
