cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>													
			<field>													
				<name>ADCMPINTEN1</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[6:5]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN2</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[8:7]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN3</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[10:9]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN4</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[12:11]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN5</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[14:13]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN6</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[16:15]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN7</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[18:17]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>ADCMPINTEN8</name>												
				<description>Threshold comparison interrupt enable.</description>												
				<bitRange>[20:19]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DISABLED</name>										
						<description>Disabled.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>OUTSIDE_THRESHOLD</name>										
						<description>Outside threshold.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CROSSING_THRESHOLD</name>										
						<description>Crossing threshold.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[31:21]</bitRange>												
												
