cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>FLAGS</name>														
		<description>A/D Flags Register. Contains the four interrupt request flags and the individual component overrun and threshold-compare flags. (The overrun bits replicate information stored in the result registers).</description>														
		<addressOffset>0x068</addressOffset>														
		<access>read-only</access>														
		<resetValue>0x0</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[0:0]</bitRange>												
			</field>													
			<field>													
				<name>THCMP1</name>												
				<description>Threshold comparison event on Channel 1. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[1:1]</bitRange>												
			</field>													
			<field>													
				<name>THCMP2</name>												
				<description>Threshold comparison event on Channel 2. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[2:2]</bitRange>												
			</field>													
			<field>													
				<name>THCMP3</name>												
				<description>Threshold comparison event on Channel 3. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[3:3]</bitRange>												
			</field>													
			<field>													
				<name>THCMP4</name>												
				<description>Threshold comparison event on Channel 4. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[4:4]</bitRange>												
			</field>													
			<field>													
				<name>THCMP5</name>												
				<description>Threshold comparison event on Channel 5. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[5:5]</bitRange>												
			</field>													
			<field>													
				<name>THCMP6</name>												
				<description>Threshold comparison event on Channel 6. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[6:6]</bitRange>												
			</field>													
			<field>													
				<name>THCMP7</name>												
				<description>Threshold comparison event on Channel 7. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[7:7]</bitRange>												
			</field>													
			<field>													
				<name>THCMP8</name>												
				<description>Threshold comparison event on Channel 8. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>												
				<bitRange>[8:8]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[9:9]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[10:10]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[11:11]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[12:12]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN1</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 1</description>												
				<bitRange>[13:13]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN2</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 2</description>												
				<bitRange>[14:14]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN3</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 3</description>												
				<bitRange>[15:15]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN4</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 4</description>												
				<bitRange>[16:16]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN5</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 5</description>												
				<bitRange>[17:17]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN6</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 6</description>												
				<bitRange>[18:18]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN7</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 7</description>												
				<bitRange>[19:19]</bitRange>												
			</field>													
			<field>													
				<name>OVERRUN8</name>												
				<description>Mirrors the OVERRRUN status flag from the result register for A/D channel 8</description>												
				<bitRange>[20:20]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[21:21]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[22:22]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[23:23]</bitRange>												
			</field>													
			<field>													
				<name>SEQA_OVR</name>												
				<description>Mirrors the global OVERRUN status flag in the SEQA_GDAT register</description>												
				<bitRange>[24:24]</bitRange>												
			</field>													
			<field>													
				<name>SEQB_OVR</name>												
				<description>Mirrors the global OVERRUN status flag in the SEQB_GDAT register</description>												
				<bitRange>[25:25]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
				<bitRange>[27:26]</bitRange>												
			</field>													
			<field>													
				<name>SEQA_INT</name>												
				<description>Sequence A interrupt. If the MODE bit in the SEQA_CTRL register is 0, this flag will mirror the DATAVALID bit in the sequence A global data register (SEQA_GDAT), which is set at the end of every A/D conversion performed as part of sequence A. It will be cleared automatically when the SEQA_GDAT register is read. If the MODE bit in the SEQA_CTRL register is 1, this flag will be set upon completion of an entire A sequence. In this case it must be cleared by writing a 1 to this SEQA_INT bit.  This interrupt must be enabled in the INTEN register.</description>												
				<bitRange>[28:28]</bitRange>												
			</field>													
			<field>													
				<name>SEQB_INT</name>												
				<description>Sequence A interrupt. If the MODE bit in the SEQB_CTRL register is 0, this flag will mirror the DATAVALID bit in the sequence A global data register (SEQB_GDAT), which is set at the end of every A/D conversion performed as part of sequence B. It will be cleared automatically when the SEQB_GDAT register is read. If the MODE bit in the SEQB_CTRL register is 1, this flag will be set upon completion of an entire B sequence. In this case it must be cleared by writing a 1 to this SEQB_INT bit.  This interrupt must be enabled in the INTEN register.</description>												
				<bitRange>[29:29]</bitRange>												
			</field>													
			<field>													
				<name>THCMP_INT</name>												
				<description>Threshold Comparison Interrupt. This bit will be set if any of the 12 THCMP flags in the lower bits of this register are set to 1 (due to an enabled out-of-range or threshold-crossing event on any channel). Each type of threshold comparison interrupt on each channel must be individually enabled in the INTEN register to cause this interrupt. This bit will be cleared when all of the component flags in bits 11:0 are cleared via writing 1s to those bits.</description>												
				<bitRange>[30:30]</bitRange>												
			</field>													
			<field>													
				<name>OVR_INT</name>												
				<description>Overrun Interrupt flag. Any overrun bit in any of the individual channel data registers will cause this interrupt. In addition, if the MODE bit in either of the SEQn_CTRL registers is 0 then the OVERRUN bit in the corresponding SEQn_GDAT register will also cause this interrupt.  This interrupt must be enabled in the INTEN register. This bit will be cleared when all of the individual overrun bits have been cleared via reading the corresponding data registers.</description>												
				<bitRange>[31:31]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>TRM</name>														
		<description>ADC trim register.</description>														
		<addressOffset>0x06C</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000F00</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[4:0]</bitRange>												
												
