cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>													
			<field>													
				<name>VRANGE</name>												
				<description>Reserved.</description>												
				<bitRange>[5:5]</bitRange>												
				<enumeratedValues>
					<enumeratedValue>
						<name>HIGHVOLTAGE</name>
						<description>High voltage. VDDA = 2.7 V to 3.6 V.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LOWVOLTAGE</name>
						<description>Low voltage. VDDA = 1.8 V to 2.7 V.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>								
			</field>													
														
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[31:6]</bitRange>												
												
			</field>													
		</fields>														
	</register>															
</registers>																
																						
	</peripheral>
  	<peripheral derivedFrom="UART0">
  		<name>UART1</name>
  		<baseAddress>0x40020000</baseAddress>
  		<addressBlock>
  			<offset>0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>UART1</name>
  			<value>22</value>
  		</interrupt>
  	</peripheral>
  	<peripheral derivedFrom="UART0">
  		<name>UART2</name>
  		<baseAddress>0x40024000</baseAddress>
  		<addressBlock>
  			<offset>0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>UART2</name>
  			<value>23</value>
  		</interrupt>
  	</peripheral>
	<peripheral>
        <name>PMU</name>
        <description>Power management unit</description>
        <groupName>PMU</groupName>
        <baseAddress>0x40038000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
	
		<registers>												
			<register>											
				<name>PCON</name>										
				<description>Power control register</description>										
				<addressOffset>0x000</addressOffset>										
				<access>read-write</access>										
				<resetValue>0x0</resetValue>										
				<resetMask>0xFFFFFFFF</resetMask>										
				<fields>										
					<field>									
						<name>RESERVED</name>								
						<description>Reserved. Do not write 1 to this bit.</description>								
						<bitRange>[0:0]</bitRange>								
												
					</field>									
					<field>									
						<name>DPDEN</name>								
						<description>Deep power-down mode enable</description>								
						<bitRange>[1:1]</bitRange>								
						<enumeratedValues>								
							<name>ENUM</name>								
							<enumeratedValue>							
								<name>SLEEPDEEPSLEEP</name>						
								<description>ARM WFI will enter Sleep or Deep-sleep mode (clock to ARM Cortex-M0 core turned off).</description>						
								<value>0</value>						
							</enumeratedValue>							
							<enumeratedValue>							
								<name>POWERDOWN</name>						
								<description>ARM WFI will enter Deep-power down mode (ARM Cortex-M0 core powered-down).</description>						
								<value>1</value>						
							</enumeratedValue>							
						</enumeratedValues>								
					</field>									
					<field>									
						<name>RESERVED</name>								
						<description>Reserved. Do not write ones to this bit.</description>								
						<bitRange>[7:2]</bitRange>								
														
					</field>									
					<field>									
						<name>SLEEPFLAG</name>								
						<description>Sleep mode flag</description>								
						<bitRange>[8:8]</bitRange>								
						<enumeratedValues>								
							<name>ENUM</name>								
							<enumeratedValue>							
								<name>ACTIVE</name>						
								<description>Read: No power-down mode entered. Active mode. Write: No effect.</description>						
								<value>0</value>						
							</enumeratedValue>							
							<enumeratedValue>							
								<name>POWERDOWN</name>						
								<description>Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>						
								<value>1</value>						
							</enumeratedValue>							
						</enumeratedValues>								
					</field>									
					<field>									
						<name>RESERVED</name>								
						<description>Reserved. Do not write ones to this bit.</description>								
						<bitRange>[10:9]</bitRange>								
													
					</field>									
					<field>									
						<name>DPDFLAG</name>								
						<description>Deep power-down flag</description>								
						<bitRange>[11:11]</bitRange>								
						<enumeratedValues>								
							<name>ENUM</name>								
							<enumeratedValue>							
								<name>NODEEPPOWERDOWN</name>						
								<description>Read: Deep power-down mode  not entered. Write: No effect.</description>						
								<value>0</value>						
							</enumeratedValue>							
							<enumeratedValue>							
								<name>DEEPPOWERDOWN</name>						
								<description>Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>						
								<value>1</value>						
							</enumeratedValue>							
						</enumeratedValues>								
					</field>									
					<field>									
						<name>RESERVED</name>								
						<description>Reserved. Do not write ones to this bit.</description>								
						<bitRange>[31:12]</bitRange>								
												
					</field>									
				</fields>										
			</register>											
			<register>											
				<dim>4</dim>										
				<dimIncrement>0x4</dimIncrement>										
				<dimIndex>0-3</dimIndex>										
				<name>GPREG[%s]</name>										
				<description>General purpose register 0</description>										
				<addressOffset>0x004</addressOffset>										
				<access>read-write</access>										
				<resetValue>0x0</resetValue>										
				<resetMask>0xFFFFFFFF</resetMask>										
				<fields>										
					<field>									
						<name>GPDATA</name>								
						<description>Data retained during Deep power-down mode.</description>								
						<bitRange>[31:0]</bitRange>								
					</field>									
				</fields>										
			</register>											
			<register>											
				<name>GPREG4</name>										
				<description>General purpose register 4</description>										
				<addressOffset>0x014</addressOffset>										
				<access>read-write</access>										
				<resetValue>0x0</resetValue>										
				<resetMask>0xFFFFFFFF</resetMask>										
				<fields>										
					<field>									
						<name>RESERVED</name>								
						<description>Reserved. Do not write ones to this bit.</description>								
						<bitRange>[9:0]</bitRange>								
												
