cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
					</field>									
					<field>									
						<name>WAKEUPHYS</name>								
						<description>WAKEUP pin hysteresis enable</description>								
						<bitRange>[10:10]</bitRange>								
						<enumeratedValues>								
							<name>ENUM</name>								
							<enumeratedValue>							
								<name>ENABLED</name>						
								<description>Hysteresis for WAKEUP pin enabled.</description>						
								<value>1</value>						
							</enumeratedValue>							
							<enumeratedValue>							
								<name>DISABLED</name>						
								<description>Hysteresis for WAKEUP pin disabled.</description>						
								<value>0</value>						
							</enumeratedValue>							
						</enumeratedValues>								
					</field>									
					<field>									
						<name>GPDATA</name>								
						<description>Data retained during Deep power-down mode.</description>								
						<bitRange>[31:11]</bitRange>								
													
					</field>									
				</fields>										
			</register>											
		</registers>												
	</peripheral>
  	<peripheral>
  		<name>FLASHCTRL</name>
  		<description>Flash controller</description>
  		<groupName>FLASHCTRL</groupName>
  		<baseAddress>0x4003C000</baseAddress>
  		<addressBlock>
  			<offset>0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>FLASH</name>
  			<value>27</value>
  		</interrupt>
  		<registers>																
  			<register>															
  				<name>FLASHCFG</name>														
  				<description>Flash access time configuration register</description>														
  				<addressOffset>0x010</addressOffset>														
  				<access>read-write</access>														
  				<resetValue>0</resetValue>														
  				<resetMask>0x00000000</resetMask>														
  				<fields>														
  					<field>													
  						<name>FLASHTIM</name>												
  						<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>												
  						<bitRange>[1:0]</bitRange>												
  						<enumeratedValues>												
  							<name>ENUM</name>												
  							<enumeratedValue>											
  								<name>1_SYSTEM_CLOCK</name>										
  								<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>										
  								<value>0x0</value>										
  							</enumeratedValue>											
  							<enumeratedValue>											
  								<name>2_SYSTEM_CLOCKS</name>										
  								<description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>										
  								<value>0x1</value>										
  							</enumeratedValue>											
  							<enumeratedValue>											
  								<name>3_SYSTEM_CLOCKS</name>										
  								<description>3 system clocks flash access time (for system clock frequencies of up to 50 MHz).</description>										
  								<value>0x2</value>										
  							</enumeratedValue>											
  							<enumeratedValue>											
  								<name>RESERVED</name>										
  								<description>Reserved.</description>										
  								<value>0x3</value>										
  							</enumeratedValue>											
  						</enumeratedValues>												
  					</field>													
  					<field>													
  						<name>RESERVED</name>												
  						<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>												
  						<bitRange>[31:2]</bitRange>												
  																	
  					</field>													
  				</fields>														
  			</register>															
  			<register>															
  				<name>FMSSTART</name>														
  				<description>Signature start address register</description>														
  				<addressOffset>0x020</addressOffset>														
  				<access>read-write</access>														
  				<resetValue>0</resetValue>														
  				<resetMask>0xFFFFFFFF</resetMask>														
  				<fields>														
  					<field>													
  						<name>START</name>												
  						<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>												
  						<bitRange>[16:0]</bitRange>												
  					</field>													
  					<field>													
  						<name>RESERVED</name>												
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
  						<bitRange>[31:17]</bitRange>												
  					</field>													
  				</fields>														
  			</register>															
  			<register>															
  				<name>FMSSTOP</name>														
  				<description>Signature stop-address register</description>														
  				<addressOffset>0x024</addressOffset>														
  				<access>read-write</access>														
  				<resetValue>0</resetValue>														
  				<resetMask>0xFFFFFFFF</resetMask>														
  				<fields>														
  					<field>													
  						<name>STOP</name>												
  						<description>BIST stop address divided by 16 (corresponds to AHB byte address [20:4]).</description>												
  						<bitRange>[16:0]</bitRange>												
											
  					</field>													
  					<field>													
  						<name>SIG_START</name>												
  						<description>Start control bit for signature generation.</description>												
  						<bitRange>[17:17]</bitRange>												
  						<enumeratedValues>												
  							<name>ENUM</name>												
  							<enumeratedValue>											
  								<name>STOP</name>										
  								<description>Stop. Signature generation is stopped</description>										
  								<value>0</value>										
  							</enumeratedValue>											
  							<enumeratedValue>											
  								<name>START</name>										
  								<description>Start. Initiate signature generation</description>										
  								<value>1</value>										
  							</enumeratedValue>											
  						</enumeratedValues>												
  					</field>													
  					<field>													
  						<name>RESERVED</name>												
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
  						<bitRange>[31:18]</bitRange>												
												
