cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>										
			<field>										
				<name>OD</name>									
				<description>Selects pseudo open-drain mode.</description>									
				<bitRange>[10:10]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>STANDARD_GPIO_OUTPUT</name>							
						<description>Standard GPIO output</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>OPEN_DRAIN_OUTPUT</name>							
						<description>Open-drain output</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved</description>									
				<bitRange>[31:11]</bitRange>									
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>PIO2_1</name>											
		<description>I/O configuration for pin PIO2_1/U0_DSR/SSP1_SCK</description>											
		<addressOffset>0x028</addressOffset>											
		<access>read-write</access>											
		<resetValue>0xD0</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>FUNC</name>									
				<description>Selects pin function. All other values are reserved.</description>									
				<bitRange>[2:0]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>PIO2_1</name>							
						<description>PIO2_1.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>U0_DSR</name>							
						<description>U0_DSR.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>SSP1_SCK</name>							
						<description>SSP1_SCK.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>MODE</name>									
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>									
				<bitRange>[4:3]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>INACTIVE_NO_PULL_DO</name>							
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PULL_DOWN_RESISTOR_E</name>							
						<description>Pull-down resistor enabled.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PULL_UP_RESISTOR_ENA</name>							
						<description>Pull-up resistor enabled.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>REPEATER_MODE</name>							
						<description>Repeater mode.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>HYS</name>									
				<description>Hysteresis.</description>									
				<bitRange>[5:5]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DISABLE</name>							
						<description>Disable.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>ENABLE</name>							
						<description>Enable.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved</description>									
				<bitRange>[9:6]</bitRange>									
								
			</field>										
			<field>										
				<name>OD</name>									
				<description>Selects pseudo open-drain mode.</description>									
				<bitRange>[10:10]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>STANDARD_GPIO_OUTPUT</name>							
						<description>Standard GPIO output</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>OPEN_DRAIN_OUTPUT</name>							
						<description>Open-drain output</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved</description>									
				<bitRange>[31:11]</bitRange>									
								
			</field>										
		</fields>											
	</register>												
													
	<register>												
		<name>PIO0_4</name>											
		<description>I/O configuration for pin PIO0_4/I2C0_SCL</description>											
		<addressOffset>0x030</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>FUNC</name>									
				<description>Selects pin function. All other values are reserved.</description>									
				<bitRange>[2:0]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>PIO0_4_OPEN_DRAIN_P</name>							
						<description>PIO0_4 (open-drain pin).</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>I2C0_SCL_OPEN_DRAIN</name>							
						<description>I2C0_SCL (open-drain pin).</description>							
						<value>0x1</value>							
					</enumeratedValue>								
													
				</enumeratedValues>									
			</field>										
			<field>										
				<name>I2CMODE</name>									
				<description>Selects I2C mode. Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 000).</description>									
				<bitRange>[9:8]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>STANDARD_FAST</name>							
						<description>Standard mode/ Fast-mode I2C.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>STANDARDIO</name>							
						<description>Standard I/O functionality</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>FAST_MODE_PLUS_I2C</name>							
						<description>Fast-mode Plus I2C</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:10]</bitRange>									
								
