cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>										
			<field>										
				<name>OD</name>									
				<description>Selects pseudo open-drain mode.</description>									
				<bitRange>[10:10]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>STANDARD_GPIO_OUTPUT</name>							
						<description>Standard GPIO output</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>OPEN_DRAIN_OUTPUT</name>							
						<description>Open-drain output</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved</description>									
				<bitRange>[31:11]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>SCK0_LOC</name>											
		<description>SCK0 pin location select register</description>											
		<addressOffset>0x0B0</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>SCKLOC</name>									
				<description>Selects pin location for SSP0_SCK function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO0_10</name>							
						<description>PIO0_10. Selects SCK0 function in pin location SWCLK/PIO0_10.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO0_6</name>							
						<description>PIO0_6. Selects SSP0_SCK function in pin location PIO0_6.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>DSR_LOC</name>											
		<description>DSR pin location select register</description>											
		<addressOffset>0x0B4</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>DSRLOC</name>									
				<description>Selects pin location for U0_DSR function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO2_1</name>							
						<description>PIO2_1. Selects U0_DSR function in pin location PIO2_1</description>							
						<value>0x0</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>DCD_LOC</name>											
		<description>DCD pin location select register</description>											
		<addressOffset>0x0B8</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>DCDLOC</name>									
				<description>Selects pin location for U0_DCD function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO2_2</name>							
						<description>PIO2_2. Selects U0_DCD function in pin location PIO2_2.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO3_2</name>							
						<description>PIO3_2. Selects U0_DCD function in pin location PIO3_2.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>RI_LOC</name>											
		<description>RI pin location select register</description>											
		<addressOffset>0x0BC</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>RILOC</name>									
				<description>Selects pin location for U0_RI function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO2_3</name>							
						<description>PIO2_3. Selects UO_RI function in pin location PIO2_3.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO3_3</name>							
						<description>PIO3_3. Selects U0_RI function in pin location PIO3_3.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
