cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>										
		</fields>											
	</register>	
		<register>												
			<name>PIO0_3</name>											
			<description>I/O configuration for pin PIO0_3/R/R/U2_RXD</description>											
			<addressOffset>0x0C0</addressOffset>											
			<access>read-write</access>											
			<resetValue>0xD0</resetValue>											
			<resetMask>0xFFFFFFFF</resetMask>											
			<fields>											
				<field>										
					<name>FUNC</name>									
					<description>Selects pin function. All other values are reserved.</description>									
					<bitRange>[2:0]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>PIO0_3</name>							
							<description>PIO0_3.</description>							
							<value>0x0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>U2_RXD</name>							
							<description>U2_RXD.</description>							
							<value>0x3</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>MODE</name>									
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>									
					<bitRange>[4:3]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>INACTIVE_NO_PULL_DO</name>							
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>							
							<value>0x0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>PULL_DOWN_RESISTOR_E</name>							
							<description>Pull-down resistor enabled.</description>							
							<value>0x1</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>PULL_UP_RESISTOR_ENA</name>							
							<description>Pull-up resistor enabled.</description>							
							<value>0x2</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>REPEATER_MODE</name>							
							<description>Repeater mode.</description>							
							<value>0x3</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>HYS</name>									
					<description>Hysteresis.</description>									
					<bitRange>[5:5]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>DISABLE</name>							
							<description>Disable.</description>							
							<value>0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>ENABLE</name>							
							<description>Enable.</description>							
							<value>1</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>RESERVED</name>									
					<description>Reserved</description>									
					<bitRange>[9:6]</bitRange>									
					
				</field>										
				<field>										
					<name>OD</name>									
					<description>Selects pseudo open-drain mode.</description>									
					<bitRange>[10:10]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>STANDARD_GPIO_OUTPUT</name>							
							<description>Standard GPIO output</description>							
							<value>0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>OPEN_DRAIN_OUTPUT</name>							
							<description>Open-drain output</description>							
							<value>1</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>RESERVED</name>									
					<description>Reserved</description>									
					<bitRange>[31:11]</bitRange>									
					
				</field>										
			</fields>											
		</register>
		
		<register>												
			<name>PIO0_6</name>											
			<description>I/O configuration for pin PIO0_6/SSP0_SCK/U1_TXD</description>											
			<addressOffset>0x0C4</addressOffset>											
			<access>read-write</access>											
			<resetValue>0xD0</resetValue>											
			<resetMask>0xFFFFFFFF</resetMask>											
			<fields>											
				<field>										
					<name>FUNC</name>									
					<description>Selects pin function. All other values are reserved.</description>									
					<bitRange>[2:0]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>PIO0_6</name>							
							<description>PIO0_6.</description>							
							<value>0x0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>RESERVED</name>							
							<description>Reserved.</description>							
							<value>0x1</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>SSP0_SCK_ONLY_IF_PI</name>							
							<description>SSP0_SCK (only if pin PIO0_6/SSP0_SCK selected in the SCK0_LOC register).</description>							
							<value>0x2</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>U1_TXD</name>							
							<description>U1_TXD.</description>							
							<value>0x3</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>MODE</name>									
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>									
					<bitRange>[4:3]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>INACTIVE_NO_PULL_DO</name>							
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>							
							<value>0x0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>PULL_DOWN_RESISTOR_E</name>							
							<description>Pull-down resistor enabled.</description>							
							<value>0x1</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>PULL_UP_RESISTOR_ENA</name>							
							<description>Pull-up resistor enabled.</description>							
							<value>0x2</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>REPEATER_MODE</name>							
							<description>Repeater mode.</description>							
							<value>0x3</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>HYS</name>									
					<description>Hysteresis.</description>									
					<bitRange>[5:5]</bitRange>									
					<enumeratedValues>									
						<name>ENUM</name>									
						<enumeratedValue>								
							<name>DISABLE</name>							
							<description>Disable.</description>							
							<value>0</value>							
						</enumeratedValue>								
						<enumeratedValue>								
							<name>ENABLE</name>							
							<description>Enable.</description>							
							<value>1</value>							
						</enumeratedValue>								
					</enumeratedValues>									
				</field>										
				<field>										
					<name>RESERVED</name>									
					<description>Reserved</description>									
					<bitRange>[9:6]</bitRange>									
					
