cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>CT16B0_CAP0_LOC</name>											
		<description>CT16B0_CAP0 pin location select register</description>											
		<addressOffset>0x0D0</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>CT16B0_CAP0LOC</name>									
				<description>Selects pin location for CT16B0_CAP0 function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO0_2</name>							
						<description>PIO0_2. Selects CT16B0_CAP0 function in pin location PIO0_2.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO3_3</name>							
						<description>PIO3_3. Selects CT16B0_CAP0 function in pin location PIO3_3.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>SCK1_LOC</name>											
		<description>SCK1 pin location select register</description>											
		<addressOffset>0x0D4</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>SCK1LOC</name>									
				<description>Selects pin location for SSP1_SCK function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO2_1</name>							
						<description>PIO2_1. Selects SSP1_SCK function in pin location PIO2_1.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO3_2</name>							
						<description>PIO3_2. Selects SSP1_SCK function in pin location PIO3_2.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>MISO1_LOC</name>											
		<description>MISO1 pin location select register</description>											
		<addressOffset>0x0D8</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>MISO1LOC</name>									
				<description>Selects pin location for the SSP1_MISO function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO2_2</name>							
						<description>PIO2_2. Selects SSP1_MISO function in pin location PIO2_2.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO1_10</name>							
						<description>PIO1_10. Selects SSP1_MISO function in pin location PIO1_10.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>MOSI1_LOC</name>											
		<description>MOSI1 pin location select register</description>											
		<addressOffset>0x0DC</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>MOSI1LOC</name>									
				<description>Selects pin location for the SSP1_MOSI function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO2_3</name>							
						<description>PIO2_3. Selects SSP1_MOSI1 function in pin location PIO2_3.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO1_9</name>							
						<description>PIO1_9. Selects SSP1_MOSI function in pin location PIO1_9.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
