cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>CT32B0_CAP0_LOC</name>											
		<description>CT32B0_CAP0 pin location select register</description>											
		<addressOffset>0x0E0</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>CT32B0_CAP0LOC</name>									
				<description>Selects pin location for the CT32B0_CAP0 function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO1_5</name>							
						<description>PIO1_5. Selects CT32B0_CAP0 function in pin location PIO1_5.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO2_9</name>							
						<description>PIO2_9. Selects CT32B0_CAP0 function in pin location PIO2_9.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>RXD_LOC</name>											
		<description>RXD pin location select register</description>											
		<addressOffset>0x0E4</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x00</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>RXDLOC</name>									
				<description>Selects pin location for the U0_RXD function.</description>									
				<bitRange>[1:0]</bitRange>									
													
				<enumeratedValues>									
				<name>ENUM</name>									
													
					<enumeratedValue>								
						<name>PIO1_6</name>							
						<description>PIO1_6. Selects U0_RXD function in pin location PIO1_6.</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO2_7</name>							
						<description>PIO2_7. Selects RXD function in pin location PIO2_7.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>RESERVED</name>							
						<description>Reserved.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>PIO3_4</name>							
						<description>PIO3_4. Selects RXD function in pin location PIO3_4.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:2]</bitRange>									
													
								
			</field>										
		</fields>											
	</register>												
													
													
</registers>													
													
													
													
													
													
													
													
													
													
													
													
															

</peripheral>


	<peripheral>
	<name>SYSCON</name>
	<description>System configuration (SYSCON)</description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>BOD</name>
	<value>26</value>
	</interrupt>
	<interrupt>
	<name>PIO0_0</name>
	<value>0</value>
	</interrupt>
	<interrupt>
	<name>PIO0_1</name>
	<value>1</value>
	</interrupt>
	<interrupt>
	<name>PIO0_2</name>
	<value>2</value>
	</interrupt>
	<interrupt>
	<name>PIO0_3</name>
	<value>3</value>
	</interrupt>
	<interrupt>
	<name>PIO0_4</name>
	<value>4</value>
	</interrupt>
	<interrupt>
	<name>PIO0_5</name>
	<value>5</value>
	</interrupt>
	<interrupt>
	<name>PIO0_6</name>
	<value>6</value>
	</interrupt>
	<interrupt>
	<name>PIO0_7</name>
	<value>7</value>
	</interrupt>
	<interrupt>
	<name>PIO0_8</name>
	<value>8</value>
	</interrupt>
	<interrupt>
	<name>PIO0_9</name>
	<value>9</value>
	</interrupt>
	<interrupt>
	<name>PIO0_10</name>
	<value>10</value>
	</interrupt>
	<interrupt>
	<name>PIO0_11</name>
	<value>11</value>
	</interrupt>
	<interrupt>
	<name>PIO1_0</name>
	<value>12</value>
	</interrupt>
																		
	<registers>																	
	<register>																
		<name>SYSMEMREMAP</name>															
		<description>System memory remap</description>															
		<addressOffset>0x000</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x002</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>MAP</name>													
				<description>System memory remap</description>													
				<bitRange>[1:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>BOOT_LOADER_MODE</name>											
						<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>USER_RAM_MODE</name>											
						<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>USER_FLASH_MODE</name>											
						<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>											
						<value>0x2</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:2]</bitRange>													
													
