cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SYSOSCCTRL</name>															
		<description>System oscillator control</description>															
		<addressOffset>0x020</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>BYPASS</name>													
				<description>Bypass system oscillator</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>OSCILLATOR_IS_NOT_BY</name>											
						<description>Oscillator is not bypassed.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>BYPASS_ENABLED</name>											
						<description>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin bypassing the oscillator. Use this mode when using an external clock source instead of the crystal oscillator.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>FREQRANGE</name>													
				<description>Determines frequency range for Low-power oscillator.</description>													
				<bitRange>[1:1]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>LOW</name>											
						<description>Low. 1 - 20 MHz frequency range.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>HIGH</name>											
						<description>High. 15 - 25 MHz frequency range</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:2]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>WDTOSCCTRL</name>															
		<description>Watchdog oscillator control</description>															
		<addressOffset>0x024</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIVSEL</name>													
				<description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>													
				<bitRange>[4:0]</bitRange>													
													
			</field>														
			<field>														
				<name>FREQSEL</name>													
				<description>Select watchdog oscillator analog output frequency (Fclkana).</description>													
				<bitRange>[8:5]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>0</name>											
						<description>0.6 MHz</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>1</name>											
						<description>1.05 MHz</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>1</name>											
						<description>1.4 MHz</description>											
						<value>0x3</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>1</name>											
						<description>1.75 MHz</description>											
						<value>0x4</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>2</name>											
						<description>2.1 MHz</description>											
						<value>0x5</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>2</name>											
						<description>2.4 MHz</description>											
						<value>0x6</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>2</name>											
						<description>2.7 MHz</description>											
						<value>0x7</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>3</name>											
						<description>3.0 MHz</description>											
						<value>0x8</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>3</name>											
						<description>3.25 MHz</description>											
						<value>0x9</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>3</name>											
						<description>3.5 MHz</description>											
						<value>0xA</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>3</name>											
						<description>3.75 MHz</description>											
						<value>0xB</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>4</name>											
						<description>4.0 MHz</description>											
						<value>0xC</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>4</name>											
						<description>4.2 MHz</description>											
						<value>0xD</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>4</name>											
						<description>4.4 MHz</description>											
						<value>0xE</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>4</name>											
						<description>4.6 MHz</description>											
						<value>0xF</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:9]</bitRange>													
													
