cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>														
			<field>														
				<name>WDT</name>													
				<description>Enables clock for WWDT.</description>													
				<bitRange>[15:15]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE</name>											
						<description>Disable</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE</name>											
						<description>Enable</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>IOCON</name>													
				<description>Enables clock for I/O configuration block.</description>													
				<bitRange>[16:16]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE</name>											
						<description>Disable</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE</name>											
						<description>Enable</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved.</description>													
				<bitRange>[17:17]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE</name>											
						<description>Disable</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE</name>											
						<description>Enable</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SSP1</name>													
				<description>Enables clock for SSP1.</description>													
				<bitRange>[18:18]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE</name>											
						<description>Disable</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE</name>											
						<description>Enable</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>UART1</name>													
				<description>Enables clock for UART1.</description>													
				<bitRange>[19:19]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE</name>											
						<description>Disable</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE</name>											
						<description>Enable</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>UART2</name>													
				<description>Enables clock for UART2.</description>													
				<bitRange>[20:20]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE</name>											
						<description>Disable</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE</name>											
						<description>Enable</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:21]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SSP0CLKDIV</name>															
		<description>SSP0 clock divider</description>															
		<addressOffset>0x094</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>SSP0_PCLK clock divider values 0: Disable SSP0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>UART0CLKDIV</name>															
		<description>UART0 clock divider</description>															
		<addressOffset>0x098</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>UART0_PCLK clock divider values 0: Disable UART0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SSP1CLKDIV</name>															
		<description>SSP1 clock divider</description>															
		<addressOffset>0x09C</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>SSP1_PCLK clock divider values 0: Disable SSP1_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>UART1CLKDIV</name>															
		<description>UART1 clock divider</description>															
		<addressOffset>0x0A0</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>UART1_PCLK clock divider values 0: Disable UART1_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>UART2CLKDIV</name>															
		<description>UART2 clock divider</description>															
		<addressOffset>0x0A4</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>UART2_PCLK clock divider values 0: Disable UART2_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>WDTCLKSEL</name>															
		<description>WDT clock source select</description>															
		<addressOffset>0x0D0</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>SEL</name>													
				<description>WDT clock source</description>													
				<bitRange>[1:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>IRC_OSCILLATOR</name>											
						<description>IRC oscillator</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>MAIN_CLOCK</name>											
						<description>Main clock</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>WATCHDOG_OSCILLATOR</name>											
						<description>Watchdog oscillator</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RESERVED</name>											
						<description>Reserved</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:2]</bitRange>													
													
