cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>WDTCLKUEN</name>															
		<description>WDT clock source update enable</description>															
		<addressOffset>0x0D4</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>ENA</name>													
				<description>Enable WDT clock source update</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_CHANGE</name>											
						<description>No change</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>UPDATE_CLOCK_SOURCE</name>											
						<description>Update clock source</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:1]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>WDTCLKDIV</name>															
		<description>WDT clock divider</description>															
		<addressOffset>0x0D8</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>WDT clock divider values 0: Disable WDCLK.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>CLKOUTCLKSEL</name>															
		<description>CLKOUT clock source select</description>															
		<addressOffset>0x0E0</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>SEL</name>													
				<description>CLKOUT clock source</description>													
				<bitRange>[1:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>IRC_OSCILLATOR</name>											
						<description>IRC oscillator</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>SYSTEM_OSCILLATOR</name>											
						<description>System oscillator</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>WATCHDOG_OSCILLATOR</name>											
						<description>Watchdog oscillator</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>MAIN_CLOCK</name>											
						<description>Main clock</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:2]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>CLKOUTUEN</name>															
		<description>CLKOUT clock source update enable</description>															
		<addressOffset>0x0E4</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>ENA</name>													
				<description>Enable CLKOUT clock source update</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_CHANGE</name>											
						<description>No change</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>UPDATE_CLOCK_SOURCE</name>											
						<description>Update clock source</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:1]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>CLKOUTCLKDIV</name>															
		<description>CLKOUT clock divider</description>															
		<addressOffset>0x0E8</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DIV</name>													
				<description>Clock output divider values 0: Disable CLKOUT.  1: Divide by 1. to 255: Divide by 255.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>PIOPORCAP0</name>															
		<description>POR captured PIO status 0</description>															
		<addressOffset>0x100</addressOffset>															
		<access>read-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>CAPPIO0_n</name>													
				<description>Raw reset status input PIO0_n: PIO0_11 to PIO0_0</description>													
				<bitRange>[11:0]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO1_n</name>													
				<description>Raw reset status input PIO1_n: PIO1_11 to PIO1_0</description>													
				<bitRange>[23:12]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO2_n</name>													
				<description>Raw reset status input PIO2_n: PIO2_7 to PIO2_0</description>													
				<bitRange>[31:24]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>PIOPORCAP1</name>															
		<description>POR captured PIO status 1</description>															
		<addressOffset>0x104</addressOffset>															
		<access>read-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>CAPPIO2_8</name>													
				<description>Raw reset status input PIO2_8</description>													
				<bitRange>[0:0]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO2_9</name>													
				<description>Raw reset status input PIO2_9</description>													
				<bitRange>[1:1]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO2_10</name>													
				<description>Raw reset status input PIO2_10</description>													
				<bitRange>[2:2]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO2_11</name>													
				<description>Raw reset status input PIO2_11</description>													
				<bitRange>[3:3]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO3_0</name>													
				<description>Raw reset status input PIO3_0</description>													
				<bitRange>[4:4]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO3_1</name>													
				<description>Raw reset status input PIO3_1</description>													
				<bitRange>[5:5]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO3_2</name>													
				<description>Raw reset status input PIO3_2</description>													
				<bitRange>[6:6]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO3_3</name>													
				<description>Raw reset status input PIO3_3</description>													
				<bitRange>[7:7]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO3_4</name>													
				<description>Raw reset status input PIO3_4</description>													
				<bitRange>[8:8]</bitRange>													
			</field>														
			<field>														
				<name>CAPPIO3_5</name>													
				<description>Raw reset status input PIO3_5</description>													
				<bitRange>[9:9]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:10]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>BODCTRL</name>															
		<description>BOD control</description>															
		<addressOffset>0x150</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>BODRSTLEV</name>													
				<description>BOD reset level</description>													
				<bitRange>[1:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>LEVEL_0</name>											
						<description>Level 0. The reset assertion threshold voltage is 1.46 V; the  reset de-assertion threshold voltage is 1.63 V.</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>LEVEL_1</name>											
						<description>Level 1. The reset assertion threshold voltage is 2.06 V; the reset de-assertion threshold voltage is 2.15 V.</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>LEVEL_2</name>											
						<description>Level 2. The reset assertion threshold voltage is 2.35 V; the reset de-assertion threshold voltage is 2.43 V.</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>LEVEL_3</name>											
						<description>Level 3. The reset assertion threshold voltage is 2.63 V; the reset de-assertion threshold voltage is 2.71 V.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>BODINTVAL</name>													
				<description>BOD interrupt level</description>													
				<bitRange>[3:2]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>RESERVED</name>											
						<description>Reserved.</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>LEVEL_1</name>											
						<description>Level 1.The interrupt assertion threshold voltage is 2.22 V; the interrupt de-assertion threshold voltage is 2.35 V.</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>LEVEL_2</name>											
						<description>Level 2. The interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V.</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>LEVEL_3</name>											
						<description>Level 3. The interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>BODRSTENA</name>													
				<description>BOD reset enable</description>													
				<bitRange>[4:4]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE_RESET_FUNCTI</name>											
						<description>Disable reset function.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE_RESET_FUNCTIO</name>											
						<description>Enable reset function.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:5]</bitRange>													
													
