cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SYSTCKCAL</name>															
		<description>System tick counter calibration</description>															
		<addressOffset>0x154</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x004</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>CAL</name>													
				<description>System tick timer calibration value</description>													
				<bitRange>[25:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:26]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>IRQLATENCY</name>															
		<description>IQR delay. Allows trade-off between interrupt latency and determinism.</description>															
		<addressOffset>0x170</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x10</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>LATENCY</name>													
				<description>8-bit latency value</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>NMISRC</name>															
		<description>NMI source selection</description>															
		<addressOffset>0x174</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>IRQNO</name>													
				<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 in this register is 1.</description>													
				<bitRange>[4:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[30:5]</bitRange>													
			</field>														
			<field>														
				<name>NMIEN</name>													
				<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>													
				<bitRange>[31:31]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>STARTAPRP0</name>															
		<description>Start logic edge control register 0</description>															
		<addressOffset>0x200</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>APRPIO00</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[0:0]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO01</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[1:1]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO02</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[2:2]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO03</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[3:3]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO04</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[4:4]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO05</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[5:5]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO06</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[6:6]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO07</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[7:7]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO08</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[8:8]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO09</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[9:9]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO010</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[10:10]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO011</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[11:11]</bitRange>													
			</field>														
			<field>														
				<name>APRPIO10</name>													
				<description>0 = Falling edge 1 = Rising edge</description>													
				<bitRange>[12:12]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Do not write a 1 to reserved bits in this register.</description>													
				<bitRange>[31:13]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>STARTERP0</name>															
		<description>Start logic signal enable register 0</description>															
		<addressOffset>0x204</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>ERPIO00</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[0:0]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO01</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[1:1]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO02</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[2:2]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO03</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[3:3]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO04</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[4:4]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO05</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[5:5]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO06</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[6:6]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO07</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[7:7]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO08</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[8:8]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO09</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[9:9]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO010</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[10:10]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO011</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[11:11]</bitRange>													
			</field>														
			<field>														
				<name>ERPIO10</name>													
				<description> 0 = Disabled 1 = Enabled</description>													
				<bitRange>[12:12]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Do not write a 1 to reserved bits in this register.</description>													
				<bitRange>[31:13]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>STARTRSRP0CLR</name>															
		<description>Start logic reset register 0</description>															
		<addressOffset>0x208</addressOffset>															
		<access>write-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>RSRPIO00</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[0:0]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO01</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[1:1]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO02</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[2:2]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO03</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[3:3]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO04</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[4:4]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO05</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[5:5]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO06</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[6:6]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO07</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[7:7]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO08</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[8:8]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO09</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[9:9]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO010</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[10:10]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO011</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[11:11]</bitRange>													
			</field>														
			<field>														
				<name>RSRPIO10</name>													
				<description> 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>													
				<bitRange>[12:12]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Do not write a 1 to reserved bits in this register.</description>													
				<bitRange>[31:13]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>STARTSRP0</name>															
		<description>Start logic status register 0</description>															
		<addressOffset>0x20C</addressOffset>															
		<access>read-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>SRPIO00</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[0:0]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO01</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[1:1]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO02</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[2:2]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO03</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[3:3]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO04</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[4:4]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO05</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[5:5]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO06</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[6:6]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO07</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[7:7]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO08</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[8:8]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO09</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[9:9]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO010</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[10:10]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO011</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[11:11]</bitRange>													
			</field>														
			<field>														
				<name>SRPIO10</name>													
				<description>0 = No start signal received. 1 = Start signal pending.</description>													
				<bitRange>[12:12]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:13]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>PDSLEEPCFG</name>															
		<description>Power-down states in Deep-sleep mode</description>															
		<addressOffset>0x230</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x00000000</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>NOTUSED1</name>													
				<description>Reserved. Always write these bits as 111.</description>													
				<bitRange>[2:0]</bitRange>													
													
