cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>														
			<field>														
				<name>BOD_PD</name>													
				<description>BOD power-down control in Deep-sleep mode, see Table 41.</description>													
				<bitRange>[3:3]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>NOTUSED2</name>													
				<description>Reserved. Always write these bits as 11.</description>													
				<bitRange>[5:4]</bitRange>													
													
			</field>														
			<field>														
				<name>WDTOSC_PD</name>													
				<description>Watchdog oscillator power control in Deep-sleep mode, see Table 41.</description>													
				<bitRange>[6:6]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>NOTUSED3</name>													
				<description>Reserved. Always write this bit as 1.</description>													
				<bitRange>[7:7]</bitRange>													
													
			</field>														
			<field>														
				<name>NOTUSED4</name>													
				<description>Reserved. Always write these bits as 000.</description>													
				<bitRange>[10:8]</bitRange>													
													
			</field>														
			<field>														
				<name>NOTUSED5</name>													
				<description>Reserved. Always write these bits as 11.</description>													
				<bitRange>[12:11]</bitRange>													
													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:13]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>PDAWAKECFG</name>															
		<description>Power-down states after wake-up from Deep-sleep mode</description>															
		<addressOffset>0x234</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x0000EDF0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>IRCOUT_PD</name>													
				<description>IRC oscillator output wake-up configuration</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>IRC_PD</name>													
				<description>IRC oscillator power-down wake-up configuration</description>													
				<bitRange>[1:1]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>FLASH_PD</name>													
				<description>Flash wake-up configuration</description>													
				<bitRange>[2:2]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>BOD_PD</name>													
				<description>BOD wake-up configuration</description>													
				<bitRange>[3:3]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>ADC_PD</name>													
				<description>ADC wake-up configuration</description>													
				<bitRange>[4:4]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SYSOSC_PD</name>													
				<description>System oscillator wake-up configuration</description>													
				<bitRange>[5:5]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>WDTOSC_PD</name>													
				<description>Watchdog oscillator wake-up configuration</description>													
				<bitRange>[6:6]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SYSPLL_PD</name>													
				<description>System PLL wake-up configuration</description>													
				<bitRange>[7:7]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>POWERED</name>											
						<description>Powered</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>POWERED_DOWN</name>											
						<description>Powered down</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>NOTUSED1</name>													
				<description>Reserved. Always write this bit as 1.</description>													
				<bitRange>[8:8]</bitRange>													
													
