cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			</field>														
			<field>														
				<name>NOTUSED2</name>													
				<description>Reserved. Always write this bit as 0.</description>													
				<bitRange>[9:9]</bitRange>													
													
			</field>														
			<field>														
				<name>NOTUSED3</name>													
				<description>Reserved. Always write this bit as 1.</description>													
				<bitRange>[10:10]</bitRange>													
													
			</field>														
			<field>														
				<name>NOTUSED4</name>													
				<description>Reserved. Always write this bit as 1.</description>													
				<bitRange>[11:11]</bitRange>													
													
			</field>														
			<field>														
				<name>NOTUSED5</name>													
				<description>Reserved.  Always write this bit as 0.</description>													
				<bitRange>[12:12]</bitRange>													
													
			</field>														
			<field>														
				<name>NOTUSED6</name>													
				<description>Reserved. Always write these bits as 111.</description>													
				<bitRange>[15:13]</bitRange>													
													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:16]</bitRange>													
													
			</field>														
		</fields>															
	</register>																
</registers>																	
													

</peripheral>

	

	<peripheral derivedFrom="SSP0">
		<name>SSP1</name>
		<baseAddress>0x40058000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>SSP1</name>
			<value>14</value>
		</interrupt>
	</peripheral>	
	<peripheral>
        <name>GPIO0</name>
        <description>GPIO0</description>
        <groupName>GPIO</groupName>
        <baseAddress>0x50000000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFFFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>GPIO0</name>
			<value>31</value>
		</interrupt>
		<registers>																							
			<register>																						
				<name>DATA</name>																					
				<description>Port n data register for pins PIOn_0 to PIOn_11</description>																					
				<addressOffset>0x3FFC</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0</resetValue>																					
				<resetMask>0x00000000</resetMask>																					
				<fields>																					
					<field>																				
						<name>DATA0</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA1</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA2</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA3</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA4</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA5</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA6</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA7</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA8</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA9</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA10</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>DATA11</name>																			
						<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>DIR</name>																					
				<description>Data direction register for port n</description>																					
				<addressOffset>0x8000</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>IO0</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO1</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO2</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO3</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO4</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO5</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO6</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO7</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO8</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO9</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO10</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>IO11</name>																			
						<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>IS</name>																					
				<description>Interrupt sense register for port n</description>																					
				<addressOffset>0x8004</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>SENSE0</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE1</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE2</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE3</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>ISENSE4</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE5</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE6</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>ISENSE7</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE8</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE9</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE10</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>SENSE11</name>																			
						<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>IBE</name>																					
				<description>Interrupt both edges register for port n</description>																					
				<addressOffset>0x8008</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>IBE0</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE1</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE2</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE3</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE4</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE5</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE6</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE7</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE8</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE9</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE10</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>EDGE11</name>																			
						<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
