cmsis-svd/cmsis-svd/data/NXP/LPC112x.svd
			<register>																						
				<name>IEV</name>																					
				<description>Interrupt event register for port n</description>																					
				<addressOffset>0x800C</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>EVENT0</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT1</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT2</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT3</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT4</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT5</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT6</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT7</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT8</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT9</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT10</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>EVENT11</name>																			
						<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOnIS (see Table 109), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOnIS (see Table 109), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>IE</name>																					
				<description>Interrupt mask register for port n</description>																					
				<addressOffset>0x8010</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>MASK0</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK1</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK2</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK3</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK4</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK5</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK6</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK7</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK8</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK9</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK10</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASK11</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>RIS</name>																					
				<description>Raw interrupt status register for port n</description>																					
				<addressOffset>0x8014</addressOffset>																					
				<access>read-only</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>RAWST0</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST1</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST2</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST3</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST4</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST5</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST6</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST7</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST8</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST9</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST10</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>RAWST11</name>																			
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>MIS</name>																					
				<description>Masked interrupt status register for port n</description>																					
				<addressOffset>0x8018</addressOffset>																					
				<access>read-only</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>MASKST0</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST1</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST2</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST3</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST4</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST5</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST6</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST7</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST8</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST9</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST10</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>MASKST11</name>																			
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
